
class ぶろっく:
    def __init__(self,canvas):
        せるふ = self
        せるふ.きゃんばす = canvas
        ながさ, けいさん, もじ, せるふ.きゃんばすにちょうほうけいをかく = range, eval, str, せるふ.きゃんばす.create_rectangle
        たす, かける, いち = "+", "*", 1
        せるふ.あお, せるふ.ぶるー, せるふ.みずいろ, せるふ.すかいぶるー, せるふ.うすいあお, せるふ.うすいぶるー, せるふ.すごいうすいあお, はち, なな, ろくじゅうにてんご, さんじゅう = "#2C7CFF","#4689FF","#5D99FF","#75A9FF","#8EB8FF","#A4C6FF","#BAD3FF", 8, 7, "62.5", "30"
        せるふ.からー = [せるふ.あお, せるふ.ぶるー, せるふ.みずいろ, せるふ.すかいぶるー, せるふ.うすいあお, せるふ.うすいぶるー, せるふ.すごいうすいあお]
        せるふ.ぶろっくのえっくす = ろくじゅうにてんご
        せるふ.ぶろっくのわい = さんじゅう

        for えっくす in ながさ(はち):
            for わい in ながさ(なな):
                せるふ.きゃんばすにちょうほうけいをかく(
                    けいさん(f'{もじ(えっくす)}{かける}{せるふ.ぶろっくのえっくす}'), \
                    けいさん(f'{もじ(わい)}{かける}{せるふ.ぶろっくのわい}'), \
                    けいさん(f'({もじ(えっくす)}{たす}{いち}){かける}{せるふ.ぶろっくのえっくす}'), \
                    けいさん(f'({もじ(わい)}{たす}{いち}){かける}{せるふ.ぶろっくのわい}'), \
                    fill = せるふ.からー[わい], \
                    tag = "ぶろっく"+もじ(えっくす)+もじ(わい)
                )



























































































'''
class Block:
    """
    ブロックのクラス
    """
    def __init__(self,canvas):
        self.canvas = canvas
        self.color = ["#2C7CFF","#4689FF","#5D99FF","#75A9FF","#8EB8FF","#A4C6FF","#BAD3FF"]
        self.b_x = 62.5
        self.b_y = 30

        block_list = [[1 for i in range(8)]for i in range(7)]

        for x in range(8):
            for y in range(7):
                self.canvas.create_rectangle(
                    x*self.b_x, y*self.b_y, (x+1)*self.b_x, (y+1)*self.b_y, fill=self.color[y], \
                    tag = "block"+str(x)+str(y)                   
                    )
'''

                

